[{"title": "The Diary Of A CEO with Steven Bartlett - DOAC", "description": "I was a broke, university dropout, at 18 I built an industry leading social media marketing company, and at 27 I resigned as CEO. At 28 I co-founded Flight Story – a marketing and communications company, and thirdweb - a software platform, making it easy to build web3 applications. I then launched private equity fund, Flight Fund, to accelerate the next generation of European unicorns. During this time I decided to launch 'The Diary Of A CEO' podcast with the simple mission of providing an unfiltered journey into the remarkable stories and untold dimensions of the world’s most influential people, experts and thinkers. \n\nIf you enjoy the show, please hit the follow button! That's a small way you can help us carry on doing this, thank you for listening. \n\nMy New Book: https://g2ul0.app.link/DOAC\nIG: https://www.instagram.com/steven\nLI: https://www.linkedin.com/in/stevenbartlett-123", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts221/v4/69/af/0d/69af0ddd-1e0f-7ae3-c84b-88f18e31ad0c/mza_14445920128472365296.png/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/the-diary-of-a-ceo-with-steven-bartlett/id1291423644?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "Money Rehab with Nicole Lapin - Money News Network", "description": "Ever notice that we will talk about everything before we talk about money? Sex? No problem. Politics? Bring it on. Money? Totally taboo. But not for long! Nicole Lapin— the only financial expert you don’t need a dictionary to understand, New York Times best-selling author, and host of Money Rehab— is here to rehab your wallet, so you can get your financial life together once and for all. Episodes are just ten minutes-ish... no frills, just bite-sized tips and tricks so you don’t waste any time. And Nicole wants to hear from YOU! Email the money questions you want answered to moneyrehab@moneynewsnetwork.com and Nicole will help–and you could even join Nicole on the show for a one-on-one intervention.", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts122/v4/b9/b8/5d/b9b85d8a-0af5-e1fe-b64d-aee26b5fe40e/mza_9602913072814988515.jpg/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/money-rehab-with-nicole-lapin/id1559564016?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "REAL AF with Andy Frisella - Andy Frisella #100to0", "description": "Entrepreneur Andy Frisella and his guests discuss, debate, and laugh their way through trending topics and hot-button issues. (This is also the home of Andy's other show, the top-ranked MFCEO Project Podcast)", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts115/v4/55/21/67/55216775-731a-1a0b-6c2a-81923902f058/mza_11706571282358600140.jpeg/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/real-af-with-andy-frisella/id1012570406?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "Young and Profiting with Hala Taha (Entrepreneurship, Sales, Marketing) - Hala Taha | Entrepreneurship, Sales, Marketing | YAP Media Network", "description": "Young and Profiting with Hala Taha is the must-listen podcast for anyone who is hardcore into entrepreneurship. Hosted by Hala Taha, a self-made entrepreneur and marketing expert, this top-ranked show features mini-masterclasses with business icons and entrepreneurs like GaryVee, Alex Hormozi, Mel Robbins, Tom Bilyeu and Codie Sanchez. Listen to YAP to profit in all aspects of life - from boosting sales and beating algorithms, to brain hacks and biohacking. Whether you’re launching a startup, scaling your business or simply wanting to expand your sales and marketing skills, each episode delivers actionable advice that WILL help you profit in life. If you want the motivation to level up your entrepreneurship game and work hard - while still prioritizing your mental and physical health - then Listen, Learn and Profit with Young and Profiting Podcast!", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts211/v4/80/c1/bd/80c1bd2c-eac4-bdb6-f8cb-ac980b4ad473/mza_16051863235006465622.jpeg/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/young-and-profiting-with-hala-taha-entrepreneurship/id1368888880?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "The Level Up Podcast w/ Paul Alex - Paul Alex Espinoza", "description": "Welcome to \"The Level Up Podcast with Paul Alex\" where empowerment meets entrepreneurship.\nI'm your host, Paul Alex.\nFrom a former law enforcement officer to a successful entrepreneur, I've made it my mission to guide individuals like yourself in generating consistent income streams.\nThis podcast is designed to ignite your motivation and propel you towards achieving your aspirations.\nJoin me on this journey as we conquer obstacles and attain our objectives together.\nRemember, I've got your six. Get ready to level up.\nMake sure to add me on Instagram: \"PaulAlex\".\nTag me on your Instagram stories and I will repost you with a SPECIAL Message!\nTake care\nPaul Alex\nFounder\nwww.OfficialPauLAlex.com", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts112/v4/50/73/a2/5073a2f1-ab72-c4dd-d14b-3377ae4f98c2/mza_4630929767217573233.jpg/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/the-level-up-podcast-w-paul-alex/id1733135157?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "I am Charles Schwartz Show - Charles Schwartz", "description": "Welcome to the I Am Charles Schwartz Show!\n\nThis podcast is an uncommon guide to getting you what you want, when you want it. From the guy who has been coaching entrepreneurs on how to retire for over a decade.\n\nThis podcast aims at making you UNSTOPPABLE.\n\nJoin us as we delve into the minds of industry leaders, entrepreneurs, and experts who have cracked the code to success. \n\nWhether you're just starting out or aiming to take your enterprise to new heights, the I am Charles Schwartz Show equips you with the tools and knowledge to navigate the path to success with confidence.", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts211/v4/b8/74/b5/b874b5cb-f9ca-3177-aebc-3298d4a7ec8d/mza_13813274674382240707.png/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/i-am-charles-schwartz-show/id1744386875?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "The Money Mondays - Dan Fleyshman", "description": "“The Money Mondays” is primed to be a global brand in the business space, focusing on investments, cash flowing businesses, side hustles and visual acts of charity. Viewers will be able to learn from experts, win weekly prizes and participate in charity efforts in an “MTV Cribs” style setting.\n\nMany episodes of the podcast will be recorded with Celebrities, influencers & athletes inside of their homes, studios & headquarters. \n\nHosted by Dan Fleyshman, the youngest founder of a publicly traded company. Dan has Angel invested in 43 companies and spoken at over 250 business industry events.", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts126/v4/a8/60/49/a860491e-a48a-2016-55c4-5426c7998dc9/mza_12477201885067188723.jpg/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/the-money-mondays/id1664983297?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "Creating Confidence with Heather Monahan - Heather Monahan | YAP Media", "description": "Looking to take your life to the next level? Each week Heather sits down to share with you the techniques and strategies to create your confidence, pursue your dreams and leapfrog the villains you’ll meet along the way. After successfully shattering the glass ceiling in corporate America, Heather is now a best-selling author, professional speaker and entrepreneur. She is currently pulling back the curtain to expose what it takes to get ahead in business and life so you can claim the greatness that you deserve. Find out why USA Today, CNN, and Steve Harvey have all featured her and most recently seen as a guest lecturer at Harvard.", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts122/v4/10/5f/b8/105fb8c5-0eff-0d25-a03b-4a704972b6b6/mza_2001570157629856111.jpeg/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/creating-confidence-with-heather-monahan/id1462192400?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "Right About Now with Ryan Alford - The Radcast Network", "description": "Welcome to Right About Now with Ryan Alford, a radically different business podcast designed for mass appeal that consistently ranks as a top 10 US Apple Podcast show. Designed to both educate and entertain, Right About Now with Ryan Alford does what few business shows can - make you think and make you smile!\n\nRight About Now is hosted by Ryan Alford, the marketing maven that has helped brands like Verizon, Apple, Lexus, and The NFL develop some of the most recognizable and successful ad campaigns of the last 20 years. Ryan interjects equal parts Southern charm, thoughtful insights, and witty commentary into a style and voice that resonates with listeners. \n\nRyan interviews celebrities, influential marketers, and entrepreneurs from across the globe while adding insight and recommendations for business owners and marketers - all told through a light-hearted lens that is equal parts entertainment and education.\n\nAs the name suggests, Right About Now with Ryan Alford isn't afraid to cross the boundaries of marketing, popular culture, and entertainment. The show features two weekly episode formats released on Tuesdays and Fridays. The Tuesday show is a guest interview while the Friday episode is an entertaining blend of weekly marketing news and banter between Ryan and Chris Hansen, his business partner and friend.\n\nVisit www.RyanIsRight.com to learn more, or follow @rightaboutnowshow and @ryanalford on Instagram.", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts122/v4/a9/1f/d2/a91fd243-f888-38b2-107f-d0460361a419/mza_1500616928130536429.jpg/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/right-about-now-with-ryan-alford/id1346054199?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "The Home Service Expert Podcast - Tommy Mello: $200 Million Founder|Forbes, Inc., Entrepreneur Columnist", "description": "The Home Service Expert podcast is the No. 1 podcast for ambitious home service entrepreneurs, whether they are in plumbing, HVAC or another niche. In this show, Tommy Mello, a $200M business founder, will talk with the best entrepreneurs and experts in the home service industry and beyond, to share insights that have made them successful: from the newest marketing tools to the best scaling strategies. Previous podcast guests include Terry Nicholson (former national trainer of NYSE-listed home services company), Craig Smith (President of HomeAdvisor, a home services marketplace valued at $2B+), Cameron Herold (former COO of three $100M+ companies), etc.", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts115/v4/1a/82/4c/1a824c56-1ce0-33cc-bdff-774352745fef/mza_4864943317204897254.jpg/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/the-home-service-expert-podcast/id1341478446?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "The Russell Brunson Show - Russell Brunson | YAP Media", "description": "Welcome to The Russell Brunson Show, a podcast that breaks free from the marketing \"box\" to explore the ideas, strategies, and stories shaping success in business and life. Building on the foundation of the Marketing Secrets Podcast, this new evolution dives into Russell’s passions and expertise beyond just marketing.\nIn each episode, Russell shares insights on marketing, selling, personal development, and the lessons he’s learned from studying some of the most important figures in history. It’s a mix of practical strategies, timeless principles, and fascinating stories that will inspire and challenge you to think differently about business and life.\nWhether you’re an entrepreneur, creator, or someone striving to make an impact, The Russell Brunson Show is your go-to guide for thinking outside the box, achieving success, and leaving your mark on the world.\nSubscribe now to join Russell as he shares his playbook and his passion for growth.", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts221/v4/37/1e/ed/371eed1f-c157-5989-aea4-25e65c61a02c/mza_7783544417505133374.jpeg/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/the-russell-brunson-show/id1315130618?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "3 Takeaways - Lynn Thoman", "description": "3 Takeaways features insights from the world’s best thinkers, business leaders, writers, politicians, scientists and other newsmakers. Each episode ends with 3 key takeaways to help you understand the world in new ways that can benefit your life and career. Hosted by Lynn Thoman.", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts211/v4/16/a4/f8/16a4f8dc-bb71-ceaa-a131-d07ebece6512/mza_3298633229048660964.jpg/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/3-takeaways/id1526080983?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "The Ramsey Show - Ramsey Network", "description": "The Ramsey Show believes you can build wealth and take control of your life—no matter what stupid mistakes you've made with money. Join as Dave Ramsey and his team of experts answer your questions on the top problems holding you back. Listen now or ask your question live by calling 888.825.5225 weekdays from 2–5 p.m. ET. Learn more at www.ramseysolutions.com", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts211/v4/b5/d2/be/b5d2bef8-16e3-9122-852a-1e02044b4d97/mza_15360827845666263980.jpg/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/the-ramsey-show/id77001367?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "Next Level Pros - Chris Lee", "description": "Welcome to Next Level Pros, where we explore the journeys of some of the most successful and inspiring entrepreneurs from around the world. I'm your host, Chris Lee.\nThroughout my career, I've founded multiple nine-figure companies and learned a thing or two about what it takes to succeed in the world of business. Now, I want to share those lessons with you by bringing on guests who have their own incredible stories to tell. I'm on a mission to find the most unique and entertaining individuals that have done it the right way.", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts211/v4/c8/7d/9b/c87d9b91-cac5-359e-6f72-c751ad6cda9a/mza_7474899587043392065.jpg/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/next-level-pros/id1687030281?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "Bred To Lead | With Dr. Jake Tayler Jacobs - SIPS Healthcare Solutions", "description": "Bred to Lead” is a transformative podcast that delves into the heart of people-first leadership. Hosted by Dr. Jake Tayler Jacobs, a seasoned entrepreneur, author, and leadership expert, this show explores the principles and practices that empower leaders to bring out the best in their teams and achieve extraordinary results.\n\nThrough candid conversations, real-world examples, and expert insights, ”Bred to Lead” challenges conventional notions of leadership and offers a new paradigm for success in the 21st century. Dr. Jacobs shares his own hard-won lessons from over a decade of leadership experience, and invites other trailblazing leaders to share their stories and strategies for putting people first.\n\n\nEach episode tackles a different aspect of people-first leadership, from building trust and psychological safety, to communicating with empathy and transparency, to developing and empowering diverse teams. Listeners will gain practical tools and techniques for transforming their leadership style, and will be inspired to create workplaces where everyone can thrive and make their unique contribution.\n\n\nWhether you’re a seasoned executive or a first-time manager, ”Bred to Lead” will help you unlock your full potential as a leader and build a culture of engagement, innovation, and purpose. Join Dr. Jake Tayler Jacobs on this transformative journey and discover how putting your people first can lead to game-changing results.", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts221/v4/00/8f/19/008f1985-36f9-571d-11a5-d02ea5c3a72f/mza_5189632502966038304.png/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/bred-to-lead-with-dr-jake-tayler-jacobs/id1744976367?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "How I Invest with David Weisburd - David Weisburd", "description": "How I Invest with David Weisburd is a podcast that interviews the world's leading institutional investors. Previous guests include The Ford Foundation, Northwestern University Endowment, CalPERS, Stepstone, and other top limited partners.", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts221/v4/6e/4e/94/6e4e9440-b7d9-4a48-ba9d-ec3977e1d29a/mza_8529512521674770076.jpg/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/how-i-invest-with-david-weisburd/id1697772657?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "PBD Podcast - PBD Podcast", "description": "The PBD Podcast is a podcast that discusses, current events, trending topics and politics as they relate to life and business. Stay tuned for new episodes and guest appearances.", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts211/v4/ad/7e/74/ad7e7422-47fe-fe86-e2d1-eaba6323650a/mza_10077304312086458683.jpg/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/pbd-podcast/id1526697745?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "The Martell Method w/ Dan Martell - Dan Martell", "description": "Dan Martell is a Canadian serial entrepreneur and angel investor. Subscribe now and learn his best strategies to build and scale successful products and businesses. Now hit that button and start the show. It's FREE.", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts211/v4/c6/6f/dc/c66fdc1e-a1f0-d18b-fd86-2146664b5094/mza_12898821534268968335.jpg/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/the-martell-method-w-dan-martell/id1170821745?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "Founder's Story - IBH Media", "description": "\"Founder's Story\" by IBH Media is an engaging show that goes deep into the personal and professional journeys of some of the most inspiring individuals in the business world. Through candid and open conversations, it uncovers the stories of CEOs, entrepreneurs, and creators from various corners of the globe. This show is more than just an interview series; it's an intimate exploration of resilience, ingenuity, and the human spirit. Guests share not only their triumphs but also their struggles and failures, providing listeners with a rich tapestry of experiences and invaluable lessons about perseverance, adaptation, and success in the face of adversity. Guests include Gary V, Codie Sanchez, Rob Dyrdek, Shelley Zalis, Noah Kaga, Kate Hancock, Ryan Serhant, Kara Goldin, will.i.am, and many more!", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts211/v4/b5/eb/fb/b5ebfb6b-f9df-8fff-3b29-e91d47529f6f/mza_13102649865249818879.jpg/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/founders-story/id1505698509?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "Living The Red Life - Rudy Mawer", "description": "Living The Red Life is your ticket to learning from The King Of Ads himself, Rudy Mawer AKA “The Man in Red''. From building an unshakable business foundation (and unstoppable team), to scaling your brand to 8-figures+, Living The Red Life is the go-to podcast for entrepreneurs & online business owners who are ready to level up their business and build a lasting legacy. Each week discover lessons from Rudy to help you scale your business and expand your thinking to new levels of success.", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts113/v4/72/8e/e3/728ee3e4-b30c-f177-2f2c-6c3e25818eff/mza_2631932327073599541.jpg/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/living-the-red-life/id1662990704?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "The Entrepreneur DNA - Justin Colby, Bleav", "description": "This podcast is focused on YOU, the entrepreneurs that want more than they have. That have experienced failure, or maybe are too scared to get off the bench because they have no guidance or advice. Maybe you are looking to finally scale your business and create the life you dreamed about. Justin and his guests will advise you in all of the ways they have become successful in business, along with all of the miss steps to avoid. This is not just all about business as these interviews gets personal and can bring just as much value to your personal life as it does to your business. I hope you enjoy, each and every episode as they are guaranteed to deliver.", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts221/v4/82/a6/da/82a6da8c-6229-79ed-974d-139d6fffb7c0/mza_6955358061968093581.jpeg/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/the-entrepreneur-dna/id1723959859?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "The Ryan Hanley Show - Ryan Hanley, Bleav", "description": "The Ryan Hanley Show examines the ideas, habits, and mindsets of world-class original thinkers use to produce extraordinary results.\n\nDive deep into the raw insights from top minds in leadership, business, and performance, delivered through candid conversations that make you feel like an insider. \n\nWe challenge the status quo because it's clear—conventional thinking has led many to dissatisfaction, poor health, and financial hardship. But not you. This podcast delivers the unguarded truths and actionable strategies the gatekeepers kept to themselves. \n\nHosted by Ryan Hanley, a relentless leader and performance strategist.\n\nThis is the way.", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts211/v4/1c/fd/72/1cfd7272-2441-38a6-7b51-e053ed321f41/mza_5467476272659209591.jpg/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/the-ryan-hanley-show/id1480262657?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "You Can! Inspiring Women In Business - Sarah Jolley-Jarvis", "description": "Inspiring and motivational this podcast has been created to re-energise and support women on their business journey to achieve consistent 5 figure income months working part time. \n\nIn this podcast I share the success of myself and others, the reality of running your own business and creating long term positive change for you and your family. \n\nThis podcast 'keeps things real', supporting you to create a consistent 5 figure per month income working part time so you can provide the presence and presents your family deserves.", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts211/v4/ba/ea/96/baea96ce-ccfe-4806-4efb-1ea859598f1b/mza_15517746842186012491.jpg/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/you-can-inspiring-women-in-business/id1688465945?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "Wake Up to Wealth - Brandon Brittingham", "description": "Welcome to the Wake Up to Wealth Podcast with your host, Brandon Brittingham! Are you ready to transform your financial future and start living the life of your dreams? If so, you're in the right place.\n\nJoin Brandon, a seasoned real estate expert, entrepreneur, and wealth-building guru, as he takes you on a journey to financial success. Each week, Brandon will be sharing invaluable insights, strategies, and inspiring stories that will help you unlock your full potential and build a life of abundance.\n\nWhether you're interested in real estate investment, entrepreneurship, or simply want to gain a better understanding of how to manage and grow your finances, Wake Up to Wealth has something for everyone. With a diverse range of guests, including industry leaders, experts, and successful individuals from various fields, Brandon will provide you with the knowledge and motivation you need to take action and achieve your financial goals.\n\nIn this podcast, you'll discover:\n\nProven wealth-building strategies and tips\nReal estate investment insights\nEntrepreneurship advice\nPersonal finance guidance\nInspirational success stories\nAnd much more!\nIf you're ready to wake up to wealth and take control of your financial destiny, join us every week for engaging conversations and actionable advice that will help you make your dreams a reality.\n\nDon't wait any longer—tune in to the Wake Up to Wealth Podcast with Brandon Brittingham and start your journey to financial independence today!", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts126/v4/32/67/1b/32671bb5-44c6-a252-f28a-6d918d746da1/mza_1116171515019459586.jpg/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/wake-up-to-wealth/id1707217868?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "The Science of Flipping - Justin Colby, Bleav", "description": "Real Estate Investing: Full time Real Estate Investor Justin Colby shares the systems to create the business and lifestyle you always dreamed about as a real estate investor. Flip homes while on vacation, flip homes while sitting on your couch. YOU will discover the systems and techniques to use in your real estate investing business. YOU will also hear from a diverse group of very successful real estate investors from across the country. The Science of Flipping podcast will help you become a millionaire real estate investor.", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts112/v4/22/b7/a2/22b7a21d-77b3-face-62ee-b4cf8905e483/mza_7827369417298520671.jpg/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/the-science-of-flipping/id714464552?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "Real Estate Without Borders - Real Estate Without Borders", "description": "\"Real Estate Without Borders\" guides investors through international property opportunities. Expert investors and market specialists share insights on global real estate investing, covering markets, legal issues, currencies, and property management. We help American investors expand their portfolios internationally, whether they're experienced or just beginning their investment journey.", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts221/v4/73/ca/5b/73ca5b8b-f7a8-7017-1e91-375650c6e908/mza_4184018523632254846.jpg/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/real-estate-without-borders/id1792968620?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "Experts of Experience - Mission.org", "description": "If your customers aren’t happy, they will let you and the whole world know. Loudly. Ever wonder how companies deliver a consistent experience that meets - and exceeds - their customer’s expectations? On this show, we’ll dive deep into the world of customer experience and share how businesses are navigating high expectations and leveraging emerging technology like AI and GPT to create the next great experience for their customers. Hosted by Lauren Wood and featuring some of the smartest business minds of the day, Experts of Experience is your go-to resource for ideas, innovation, and inspiration to level up your CX. \n\nThis podcast is presented by Salesforce Customer Success.", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts126/v4/1e/44/54/1e445436-baa9-b7c8-7f65-6c60a024ddae/mza_12191141981197400817.jpg/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/experts-of-experience/id1713550839?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "Chief Change Officer - Vince Chan", "description": "What’s Stopping You from Outgrowing Yourself?\n\nChange Ambitiously. Outgrow Yourself.\n\nAt Chief Change Officer, we harness change as a superpower—fueled by global role models who candidly share their insights, hindsights, and foresights—what we call deep human intelligence.\n\nThis isn’t digitized knowledge or AI-generated advice. It’s real, time-tested, experience-driven wisdom—the kind that blends logic and love, art and science.\n\nFor me, this show marks career transition #18. Over 17 transitions, I’ve been guided by countless role models, emerging stronger, better, and happier at every critical juncture. Now, I’m here to pass that superpower on to you, bringing together global role models as your guides for personal and professional transformation.\n\nIf you’re a growth progressive, a black horse, a visionary underdog, a transformation guru, or a bold-hearted changemaker—this podcast is for you. Because you are the Chief Change Officer.\n\nOur mission?\nTo help you become wiser in action, clearer in thought, and more ambitious—so you can outgrow yourself and achieve outcomes beyond imagination and calculation.\n\nA better you awaits.\n\n110,000+ followers are already outgrowing.\nSubscribe now @chiefchangeofficer on LinkedIn, Apple, Spotify, and YouTube.", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts211/v4/1a/61/3a/1a613a0e-f3f5-e06e-6d91-74b1d1b47f6f/mza_7984876930731562005.jpeg/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/chief-change-officer/id1735006441?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "Escaping the Drift with John Gafford - John Gafford", "description": "Escaping the Drift with John Gafford (formerly the Power Move)Do you want to level up? Are you feeling stuck in a never-ending drift, like you are aimlessly floating through life without a clear sense of direction? Do you yearn for a breakthrough that can propel you from mediocrity to remarkable success? If you're ready to escape the current and start swimming against the tide, join host John Gafford on the thought-provoking podcast, \"Escaping the Drift.\"In each episode, John engages in intimate conversations with top performers across various fields who have successfully transcended the shackles of mediocrity. These extraordinary individuals share their secrets, stories, and strategies that enabled them to rise above the mundane and achieve exceptional levels of success.\"Escaping the Drift\" is a treasure trove of insights for those who feel like they're merely drifting through life, searching for purpose and a higher calling. Whether you're an aspiring entrepreneur, a creative soul in pursuit of breakthroughs, an athlete striving for peak performance, or anyone who wants to tap into their untapped potential, this podcast offers a roadmap to transform your life.Through compelling and thought-provoking interviews, John Gafford unveils the mindset shifts, daily habits, and actionable techniques that have propelled these top performers to new heights. Learn how they harnessed their passions, overcame obstacles, and capitalized on opportunities to achieve extraordinary success.Each episode of \"Escaping the Drift\" is an immersive experience that leaves no stone unturned. Dive into the captivating stories of remarkable individuals who have mastered the art of swimming against the current. Discover how they turned adversity into advantage, setbacks into stepping stones, and dreams into reality.John Gafford's authentic and empathetic interviewing style creates a safe space for guests to share their triumphs and tribulations. By exploring their unique journeys, listeners gain invaluable lessons, practical strategies, and the inspiration needed to break free from the drift and embrace a life of purpose and fulfillment.If you're ready to break free from the monotony of mediocrity and unleash your true potential, \"Escaping the Drift\" is the podcast for you. Join John Gafford and his exceptional guests as they unravel the secrets of success and empower you to swim against the currents of life. It's time to leave behind the drift and embark on a transformative journey towards excellence.Learn More at www.EscapingtheDrift.com", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts211/v4/a4/68/a1/a468a1b3-9d08-1100-547b-eae03c66b38e/mza_108703311550940884.jpg/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/escaping-the-drift-with-john-gafford/id1582927283?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "NerdWallet's Smart Money Podcast - NerdWallet Personal Finance", "description": "NerdWallet’s trusted finance journalists answer real-world money questions to help you make smarter financial decisions with confidence.\n\nEach episode dives deep into topics like budgeting, saving, investing, home buying, and credit cards, cutting through misinformation to bring you clear, actionable advice backed by thorough research.\n\nBy the end of every episode, you’ll have the latest financial insights and the tools you’ll need to manage your money wisely, build wealth, and plan for life’s milestones. Future You will thank you.\n\nJoin hosts Sean Pyles, CFP®, Sara Rathner, and other expert Nerds as they answer your biggest money questions and share strategies to help you build wealth and reach your financial goals, including:\n\n– Investing: Advanced investment strategies, integrating ETFs and mutual funds into a diversified portfolio, tax-efficient retirement planning, understanding Roth IRA conversions, and navigating robo-advisors.\n\n– Credit Cards: Top credit cards for travel rewards and luxury perks, balance transfer strategies, maximizing credit card points, and optimizing credit card usage to boost your credit score.\n\n– Personal Finance: Advanced budgeting tips, building generational wealth, creating effective savings plans, managing high-income expenses, and developing a strong money growth mindset.\n\n– Home: Smart strategies for homebuying in competitive markets, leveraging home equity loans and HELOCs, refinancing for long-term savings, first-time homebuying tips, and budgeting for major home improvements.\n\nIf you’re searching for the best personal finance podcasts or want practical knowledge to make smarter money decisions, then follow NerdWallet’s Smart Money Podcast.\n\nYou’ll love NerdWallet’s Smart Money Podcast if you like podcasts like: Planet Money, The Personal Finance Podcast, DIY Money, Afford Anything, How to Money, The Ramsey Show, Money Rehab with Nicole Lapin, NPR’s Life Kit: Money, Popcorn Finance, Money Girl,Money Guy Show, Everyone’s Talkin’ Money, So Money with Farnoosh Tarabi, The Money with Katie Show, All the Hacks with Chris Hutchins, The Stacking Benjamins Show, MoneyWatch with Jill Schlesinger, or Your Money, Your Wealth.\n\nNerdWallet Compare, Inc. NMLS ID# 1617539 NMLS Consumer Access: http://www.nmlsconsumeraccess.org/", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts221/v4/c5/62/a7/c562a785-4edf-d22b-dbb7-994037c9f2d6/mza_149898594603054178.png/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/nerdwallets-smart-money-podcast/id1256091892?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "Special Ops - Emma Rainville", "description": "Welcome to Special Ops, the tactical business podcast designed to help you grow your company through action, not words.\n\nHosted by seasoned entrepreneur Emma Rainville.\n\nIn each episode, Emma share strategies she used in her businesses to overcome revenue growth challenges, increase profit margins, and build leadership teams that run day-to-day business operations without you, as the CEO/founder, getting involved.\n\nEach episode is designed around a free downloadable playbook to help you execute, which you can download for free at https://specialopspodcast.com.\n\nHit play on the most recent episode, and subscribe now on Apple, Spotify, or YouTube, and take your business to new heights.", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts221/v4/4e/18/78/4e1878a1-684a-6478-208a-8510c066621a/mza_12036052871196203619.jpg/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/special-ops/id1774589811?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "Business Lunch - Roland Frasier", "description": "How much more successful would you be if you had lunch once a week with an insanely successful entrepreneur who shared their biggest secrets on how they think and achieve success? Well, now you can! Grab your seat at the table as successful entrepreneurs reveal their step-by-step strategies, fascinating stories, travel hacks and other delicious tidbits each week with serial entrepreneur/business strategist, Roland Frasier.", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts126/v4/d3/b8/9c/d3b89c63-2439-ed91-d301-51ffcd8543d5/mza_15429077032501722678.jpeg/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/business-lunch/id1442654104?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "The Prof G Pod with Scott Galloway - Vox Media Podcast Network", "description": "Bestselling author, professor and entrepreneur Scott Galloway combines business insight and analysis with provocative life and career advice.\nOn Mondays, Prof G Markets breaks down what’s moving the capital markets, teaching the basics of financial literacy so you can build economic security.\nWednesdays, during Office Hours, Scott answers your questions about business, career, and life.\nThursdays, Scott has a conversation with a blue-flame thinker in the innovation economy.\nAnd Scott closes the week on Saturdays with his Webby Award–winning newsletter, No Mercy / No Malice, as read by actor and raconteur George Hahn.\nTo resist is futile…\nWant to get in touch? Email us, officehours@profgmedia.com", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts122/v4/bf/51/49/bf514994-46cf-e232-d9d8-04f43e5cd73e/mza_13006823613766388873.jpeg/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/the-prof-g-pod-with-scott-galloway/id1498802610?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "Marketplace - Marketplace", "description": "Every weekday, host Kai Ryssdal helps you make sense of the day’s business and economic news — no econ degree or finance background required. “Marketplace” takes you beyond the numbers, bringing you context. Our team of reporters all over the world speak with CEOs, policymakers and regular people just trying to get by.", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts221/v4/ca/52/f1/ca52f197-1674-7f36-566f-681b4d88d535/mza_18252511305893779184.png/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/marketplace/id201853034?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "Your Money Guide on the Side - Tyler Gardner", "description": "Your go-to podcast for mastering money and investing. Hosted by Tyler Gardner, a trusted influencer with over 2M followers, Your Money Guide on the Side simplifies the complex, adds nuance to what seems simple, and connects you with the brightest minds in finance, investing, and business. Whether you’re just starting or leveling up, this is your one-stop resource to navigate your own finances with clarity, confidence, and a bit of fun. Let’s get you one step closer to where you need to be.", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts211/v4/34/c0/06/34c00643-d3ce-99f7-4ed1-4dc4f3b91835/mza_8307470856775233469.jpg/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/your-money-guide-on-the-side/id1799219049?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "Help Wanted - Money News Network", "description": "Do you have a work problem? We have solutions.\nOn Help Wanted, Entrepreneur editor in chief Jason Feifer and money expert Nicole Lapin help you stay ahead of the curve and make money doing what you love — no matter if you’re trying to impress your boss, or if you ARE the boss.\nWant some help? Email helpwanted@moneynewsnetwork.com for a chance to have your work question answered on the show!", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts221/v4/e6/6e/22/e66e2200-4ccc-45bf-2fb5-e6e87a1a087b/mza_3882829218172022618.jpeg/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/help-wanted/id1456031960?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "Planet Money - NPR", "description": "Wanna see a trick? Give us any topic and we can tie it back to the economy. At Planet Money, we explore the forces that shape our lives and bring you along for the ride. Don't just understand the economy – understand the world.Wanna go deeper? Subscribe to Planet Money+ and get sponsor-free episodes of Planet Money, The Indicator, and Planet Money Summer School. Plus access to bonus content. It's a new way to support the show you love. Learn more at plus.npr.org/planetmoney", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts116/v4/4a/70/18/4a7018be-cad8-6440-e1ac-04f6355844a7/mza_17773332374488416462.jpg/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/planet-money/id290783428?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "Is Business Broken? - Questrom School of Business", "description": "Conversations about the role of business in society, brought to you by the Ravi K. Mehrotra Institute for Business, Markets & Society at BU Questrom School of Business.", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts211/v4/8c/f2/d2/8cf2d257-e755-d82f-5e2a-6aeeb135581d/mza_6747374407620634629.jpg/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/is-business-broken/id1741997589?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "A Bit of Optimism - Simon Sinek", "description": "The future is always bright…if you know where to look. Join me each week for A Bit of Optimism! I talk to inspiring people who teach me more about life, leadership and general interesting things.", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts211/v4/da/7a/f2/da7af2e2-fa3e-be96-8212-ac103f3ee256/mza_5671077853408510739.jpg/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/a-bit-of-optimism/id1515385282?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "Networth and Chill with Your Rich BFF - Vivian Tu", "description": "Vivian Tu, aka Your Rich BFF, is getting up close and personal, about the good, bad, and ugly on how money impacts all of our lives. Instead of your traditional boring business podcast, Networth and Chill covers financial topics as they relate to YOUR ACTUAL LIFE, all while feeling like a conversation with your best friend. Each episode breaks down a complicated economic or business concept into easy to understand terms, while tapping experts, professionals, and some of your favorite famous faces to give actionable tips & advice on how to make the most of your money. Grab a drink and get ready to Networth and Chill. Part of the Vox Media Podcast Network.", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts211/v4/8a/ae/af/8aaeafd8-4ee9-7891-e9be-b4533da82513/mza_3357629495362138028.jpeg/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/networth-and-chill-with-your-rich-bff/id1676999261?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "People Magic: How to Build a $1M Community - Mighty Networks & Pod People", "description": "What if it was easy to create a $1M digital business you could be proud of?\nThe path lies in creating people magic.\nGina Bianchini, founder and CEO of Mighty Networks, has helped over 10,000 entrepreneurs, brands, and creators grow incredible businesses that put people first and generate millions in profit.\nNow she’s bringing the secrets of the most successful communities directly to you. \nIn this series, Gina will show you how to build a community so valuable you can charge for it and so well-designed it essentially runs itself. She’ll answer your most pressing questions surrounding community building like: what has changed in the past six months that makes building a community so profitable TODAY? What is the #1 mistake new community builders make? How do you find members?  \nJoin us for People Magic today.", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts211/v4/74/dd/d5/74ddd53b-e28f-6ce9-ddc0-483760b5f706/mza_14536788999652126946.jpg/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/people-magic-how-to-build-a-%241m-community/id1752507039?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "Mind The Business: Small Business Success Stories - iHeartPodcasts", "description": "Owning a small business can be one of the most rewarding and challenging things a person does. Amid an uncertain economy and ever-evolving consumer trends, there is a lot to figure out and navigate to ensure your business thrives. Join hosts Jannese Torres (Yo Quiero Dinero) and Austin Hankwitz (Rate of Return) as they connect with small business owners and hear their stories about managing the ups and downs of starting and growing a small business. Listen to \"Mind the Business: Small Business Success Stories\" and learn valuable lessons from their experiences that will guide you along the way through your own small business journey. ", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts126/v4/89/7a/36/897a3652-3059-a183-c203-fd69ee494193/mza_816018789850494791.jpg/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/mind-the-business-small-business-success-stories/id1678320252?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "Scam Inc from The Economist - The Economist", "description": "A sophisticated, predatory, multi-billion dollar industry is emerging from the shadows. It already rivals the size of the illicit drug trade. And it’s about to get bigger and much more powerful. \nThe Economist’s Sue-Lin Wong follows a trail that starts with the collapse of a bank in rural Kansas to uncover a global, underground scam economy built around human trafficking, corruption and money laundering. Can it be stopped?\nTo listen to the full series subscribe to Economist Podcasts+.", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts221/v4/49/e9/84/49e98473-59a4-9112-6a10-ec47a742e879/mza_12881383232256725683.jpeg/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/scam-inc-from-the-economist/id1785226676?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "A Book with Legs - Smead Capital Management", "description": "Welcome to A Book with Legs podcast, hosted by Smead Capital Management. In each episode, the folks at Smead Capital Management explore value investing through an entirely unique lens, bringing in authors to discuss books that have directly or indirectly influenced the decisions the Smead team has made on their investments in stocks and equities. The podcast is for the curious-minded looking for worldly wisdom. Investing is the last great liberal art, and the team at Smead wants to learn as much as they can. Any level of investor, business person, or thinker, whether personally or professionally, will be intrigued and engaged by these discussions.", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts116/v4/c7/08/11/c70811aa-829d-c7d4-b5b9-c005a6506a2b/mza_17809629014737604387.png/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/a-book-with-legs/id1608960458?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "The Indicator from Planet Money - NPR", "description": "A little show about big ideas. From the people who make Planet Money, The Indicator helps you make sense of what's happening today. It's a quick hit of insight into work, business, the economy, and everything else. Listen weekday afternoons.Try Planet Money+! a new way to support the show you love, get a sponsor-free feed of the podcast, *and* get access to bonus content. You'll also get access to The Indicator and Planet Money Summer School, both without interruptions. sign up at plus.npr.org/planetmoney", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts221/v4/23/0c/ea/230cea2b-1d52-ff1c-9c57-318398639f94/mza_17968457450370483512.jpg/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/the-indicator-from-planet-money/id1320118593?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "Morning Brew Daily - Morning Brew", "description": "Morning Brew Daily, a daily talk show that covers the latest news on business, the economy, and everything else, with Neal Freyman and Toby Howell. Witty, informative and everything you need to start your day. Available on all podcasting platforms and Youtube.", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts221/v4/4a/2d/d9/4a2dd978-e841-3e6b-aef3-a47a594afa08/mza_8848074917186345349.jpeg/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/morning-brew-daily/id1480059697?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "How I Built This with Guy Raz - Guy Raz | Wondery", "description": "Guy Raz interviews the world’s best-known entrepreneurs to learn how they built their iconic brands. In each episode, founders reveal deep, intimate moments of doubt and failure, and share insights on their eventual success. How I Built This is a master-class on innovation, creativity, leadership and how to navigate challenges of all kinds.\nNew episodes release on Mondays and Thursdays. Listen to How I Built This on the Wondery App or wherever you listen to your podcasts. You can listen early and ad-free on Wondery+. Join Wondery+ in the Wondery App, Apple Podcasts or Spotify. Start your free trial by visiting wondery.com/links/how-i-built-this now. \nGet your How I Built This merch at WonderyShop.com/HowIBuiltThis.", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts126/v4/64/45/06/644506b5-c44f-f661-f74e-f63a4b2511bc/mza_14892199991035639268.jpeg/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/how-i-built-this-with-guy-raz/id1150510297?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "Jocko Podcast - Jocko DEFCOR Network", "description": "Retired Navy SEAL, Jocko Willink and Director, Echo Charles discuss discipline and leadership in business, war, relationships and everyday life.", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts116/v4/e8/d9/54/e8d95480-c500-9306-89c1-9503a8eca007/mza_17025325643591784610.jpg/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/jocko-podcast/id1070322219?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "Odd Lots - Bloomberg", "description": "Bloomberg's Joe Weisenthal and Tracy Alloway explore the most interesting topics in finance, markets and economics. Join the conversation every Monday and Thursday.", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts211/v4/f3/99/6a/f3996a52-e4a4-bf0d-b7d6-e376c4058568/mza_15550359494736224565.jpg/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/odd-lots/id1056200096?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "Prof G Markets - Vox Media Podcast Network", "description": "Prof G Markets breaks down the news that’s moving the capital markets, helping you build financial literacy and security. Tune in every Monday and Thursday for no mercy, no malice insight from Scott Galloway and Ed Elson on high flying stocks, booming sectors, and master of the universe CEOs. Like it or not, we live in a capitalist society. The key to navigating it? Talk about money. Part of the Vox Media Podcast Network.", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts221/v4/54/92/c7/5492c7de-426d-4da4-892d-67922c6403b8/mza_18223944006801752276.jpeg/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/prof-g-markets/id1744631325?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "Most Innovative Companies - Fast Company", "description": "Which companies are on the cutting edge of artificial intelligence? What’s the next major breakthrough in healthcare? How do iconic brands reinvent themselves to appeal to the next generation? Most Innovative Companies is where tech, business, and innovation convene. Join hosts Yasmin Gagne and Josh Christensen as they bring you the latest innovations transforming business and society—and highlights the companies that are reshaping industries and culture.", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts112/v4/95/86/9f/95869f4a-7266-9559-f059-5f6590a6125c/mza_14708779049083143013.png/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/most-innovative-companies/id1576874503?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "The Tim Ferriss Show - Tim Ferriss: Bestselling Author, Human Guinea Pig", "description": "Tim Ferriss is a self-experimenter and bestselling author, best known for The 4-Hour Workweek, which has been translated into 40+ languages.  Newsweek calls him \"the world's best human guinea pig,\" and The New York Times calls him \"a cross between Jack Welch and a Buddhist monk.\"  In this show, he deconstructs world-class performers from eclectic areas (investing, chess, pro sports, etc.), digging deep to find the tools, tactics, and tricks that listeners can use.", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts126/v4/18/39/b4/1839b420-7aff-c501-5d0d-af2842fba013/mza_6255154260686997849.jpeg/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/the-tim-ferriss-show/id863897795?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "Motley Fool Money - The Motley Fool", "description": "Motley Fool Money is a daily podcast for stock investors.\nWeekday episodes offer a long-term perspective on business news with The Motley Fool's investment analysts. Weekend shows are a mix of investing classes and longer-form interviews.\nThe show is hosted by Dylan Lewis, Ricky Mulvey, and Mary Long.", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts112/v4/66/d6/44/66d644b7-078b-5c37-194f-0a40d5bcc9a7/mza_12694853226895127281.jpeg/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/motley-fool-money/id306106212?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "The Economics of Everyday Things - Freakonomics Network & Zachary Crockett", "description": "Who decides which snacks are in your office’s vending machine? How much is a suburban elm tree worth, and to whom? How did Girl Scout Cookies become a billion-dollar business? In bite-sized episodes, journalist Zachary Crockett looks at quotidian things and finds amazing stories.\n\nTo get every show in the Freakonomics Radio Network without ads and a monthly bonus episode of Freakonomics Radio, start a free trial for SiriusXM Podcasts+ on Apple Podcasts or by visiting siriusxm.com/podcastsplus.", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts123/v4/af/fd/65/affd65ae-8648-0874-478e-52293994fede/mza_4240739714496104053.jpg/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/the-economics-of-everyday-things/id1666678354?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "Think Fast Talk Smart: Communication Techniques - Matt Abrahams, Think Fast Talk Smart", "description": "One of the most essential ingredients to success in business and life is effective communication. \nJoin Matt Abrahams, best-selling author and Strategic Communication lecturer at Stanford Graduate School of Business, as he interviews experts to provide actionable insights that help you communicate with clarity, confidence, and impact. From handling impromptu questions to crafting compelling messages, Matt explores practical strategies for real-world communication challenges.\n\nWhether you’re navigating a high-stakes presentation, perfecting your email tone, or speaking off the cuff, Think Fast, Talk Smart equips you with the tools, techniques, and best practices to express yourself effectively in any situation. Enhance your communication skills to elevate your career and build stronger professional relationships.\n\nTune in every Tuesday for new episodes. Subscribe now to unlock your potential as a thoughtful, impactful communicator. Learn more and sign up for our eNewsletter at fastersmarter.io.", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts221/v4/43/d7/bb/43d7bb86-979f-7621-824c-1ea5bbc43814/mza_16467968865268374041.jpg/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/think-fast-talk-smart-communication-techniques/id1494989268?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "The $100 MBA Show - Omar Zenhom", "description": "Awarded Best of iTunes, The $100 MBA Show is a podcast where you simply get better at business with our practical business lessons for the real world. These no fluff episodes are packed with only the pure business building training you want.\n\n\n\nOmar Zenhom (@TheOmarZenhom) shares some of the best lessons, concepts, examples and insights from inside The $100 MBA training and community. Omar also calls upon some of the industry's top experts as guest teachers on the show. Again, no backstories or promotions, just solid business lessons from the best in the game.", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts221/v4/05/8b/b4/058bb444-21ad-44bb-241c-a1c1d8131403/mza_15142895205498082348.png/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/the-%24100-mba-show/id906218859?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "Dream Life Club - Sumi Krishnan", "description": "Dream Life Club is the show for women entrepreneurs and founders who are ready to build their businesses and scale to a million and beyond in revenue. \n\nMove over Old Boy’s Club, we are the Dream Life Club - the club for women entrepreneurs who are building profitable companies that scale - and doing it our own way. \n\nJoin award-winning entrepreneur, artist, and coach, Sumi Krishnan as she shares specific mindsets, strategies and tactics to help you with your own goals. Featured in media like Forbes, CNN, and Inc. for her entrepreneurial accomplishments including building an 8-figure/year, 200-person consulting firm, Sumi brings a powerful blend of insight and optimism to each episode. \n\n\nFor FREE access to Sumi's training on 'How to scale your business to 7-figures', you can visit: https://bit.ly/4glWiw5", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts211/v4/dc/a7/c1/dca7c18a-9400-1bbe-8fdf-50dba9c82c06/mza_1622306291388302510.jpg/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/dream-life-club/id1756171805?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "Founders - David Senra", "description": "Learn from history's greatest entrepreneurs. Every week I read a biography of an entrepreneur and find ideas you can use in your work. This quote explains why: \"There are thousands of years of history in which lots and lots of very smart people worked very hard and ran all types of experiments on how to create new businesses, invent new technology, new ways to manage etc. They ran these experiments throughout their entire lives. At some point, somebody put these lessons down in a book. For very little money and a few hours of time, you can learn from someone’s accumulated experience. There is so much more to learn from the past than we often realize. You could productively spend your time reading experiences of great people who have come before and you learn every time.\" —Marc Andreessen", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts221/v4/92/0a/fe/920afefe-3144-7bca-e6ad-6556e6723c2e/mza_16269379100303032752.jpg/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/founders/id1141877104?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "The Game with Alex Hormozi - Alex Hormozi", "description": "Welcome to The Game w/Alex Hormozi, hosted by entrepreneur, founder, investor, author, public speaker, and content creator Alex Hormozi. On this podcast you’ll hear how to get more customers, make more profit per customer, how to keep them longer, and the many failures and lessons Alex has learned on his path from $100M to $1B in net worth.", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts221/v4/2f/54/0d/2f540d9c-bf31-4e40-02ca-67c4483634f5/mza_13803311963218242970.jpg/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/the-game-with-alex-hormozi/id1254720112?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "Money For Couples with Ramit Sethi - Ramit Sethi", "description": "Get Ramit's new book, Money for Couples at iwt.com/moneyforcouples. From Ramit Sethi, host of Netflix’s ‘How to Get Rich’ and author of NYT bestselling books, ‘I Will Teach You To Be Rich,’ and ‘Money for Couples’…\n\nImagine listening in on raw, unfiltered conversations with real couples, to explore how money psychology affects their everyday lives. Ramit talks with couples from all walks of life, helping them to get past guilt, resentment, & fighting over purchases, to help them create a shared vision for their Rich Life.\n\nRamit asks the questions we wish we all could ask, presenting a new philosophy on money: spend extravagantly on the things you love, and cut costs mercilessly on the things you don’t.\n\nFollow Money For Couples on Instagram, YouTube, Facebook, and X to start living your rich life today.\n\nIn Money for Couples, Ramit delves into the often-hidden dynamics around money issues in marriage, which can be some of the biggest challenges couples face. Money psychology impacts everything from everyday decisions to long-term dreams, and Ramit's finance coaching sessions with couples offer an eye-opening look into the deeper emotions behind financial choices.\n\nWhether you're wondering how to save for a big goal, how to invest in a shared future, or simply looking to understand personal finance in a relationship better, this podcast delivers practical, actionable insights. Each conversation reveals that money in marriage isn't just about numbers—it's about values, trust, and working together toward a Rich Life that's unique to each couple. Ramit provides a safe space for couples to unpack the beliefs and habits that may hold them back financially, guiding them toward a shared vision for their lives. With humor and empathy, Ramit's finance coaching shows couples that they can learn to save and spend in ways that enhance, rather than hinder, their relationship.\n\nMoney for Couples is not only a finance podcast but a journey into what makes a marriage strong, financially and emotionally. Through the lens of personal finance, Ramit provides a blueprint for couples to navigate the challenges of managing money together, offering tools to make confident, aligned choices. So, whether you're a fan of the Ramit Sethi podcast or new to his philosophy, tune in and learn how to save, how to invest, and how to create a financial future with the person you love.\n\nRamit's unique approach to money psychology helps couples overcome common money issues in marriage, from guilt and resentment over purchases to aligning on long-term financial goals. By exploring real couples' stories, Ramit offers insights into how money mindset affects everyday decisions and bigger life dreams. His finance coaching provides couples with a safe space to unpack their beliefs and habits around spending, saving, and investing.\n\nRather than focusing solely on the numbers, Ramit emphasizes the importance of values, trust, and working together toward a shared vision for a Rich Life. Couples will learn practical strategies for managing money as a team, from saving for big purchases to building investment portfolios. Ramit's philosophy of \"spend extravagantly on the things you love, and cut costs mercilessly on the things you don't\" empowers listeners to make financial choices that enhance their relationship.\n\nMoney for Couples is an essential listen for any married or committed pair looking to improve their personal finance skills and deepen their emotional connection. Ramit's finance coaching and the real-life stories of the couples he features offer a blueprint for navigating the challenges of money in marriage. Whether you're a long-time listener of Ramit's work or new to his approach, this podcast will transform how you think about spending, saving, and investing as a couple.", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts221/v4/14/e8/32/14e8324f-fa49-894b-ea9a-e6c7caf241b4/mza_11012089900512866427.jpeg/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/money-for-couples-with-ramit-sethi/id1577864998?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "The Compound and Friends - The Compound", "description": "Join Downtown Josh Brown, Michael Batnick, and a rotation of their friends every Friday for expert insight and hot takes on the latest in business and investing.\n\nSee our disclosures here - https://ritholtzwealth.com/podcast-youtube-disclosures/", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts122/v4/c2/f7/d0/c2f7d0fb-b08d-9cc4-918a-a56940c875a9/mza_10107675403773292942.jpeg/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/the-compound-and-friends/id1456467014?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "Build Your Business: From Fear to Freedom - Chris Reynolds, Matt Reynolds, Barbell Logic, The Radcast Network", "description": "Are you a business owner or startup founder struggling to navigate the challenges of growth? Join seasoned entrepreneurs Matt and Chris Reynolds on the Build Your Business Podcast, where they share decades of experience to help you overcome obstacles and achieve lasting success.\n\nWe’ll simplify the startup process, provide actionable strategies for growth, and offer invaluable insights to help you.\n\nWhat you'll gain:\n\nOvercome your fears: Break through the anxiety and uncertainty that often hold entrepreneurs back.\n\nTurn passion into profit: Learn practical strategies to monetize your ideas and grow a financially successful business.\n\nBuild a lasting legacy: Discover how to create a sustainable, thriving company that stands the test of time.\n\nTune in for expert advice, real-world success stories, and actionable insights that will take your business to the next level. \n\nWhether you're just starting out or looking to scale, the Build Your Business Podcast will empower you to transform fear into freedom.", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts211/v4/45/e9/14/45e9147a-fa84-c8a5-5460-2185eb21b78e/mza_1449670543743862284.jpg/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/build-your-business-from-fear-to-freedom/id1774561203?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "Brand New World - Fast Company", "description": "Artificial Intelligence will be the single most disruptive force the world has ever seen. It will change the way we work, the way we communicate, even the very nature of our existence. The world as we know it will be torn down and AI will build a new utopia from the ashes. Or . . . maybe it will do none of that! In reality, it’s way too early to predict the scope of AI’s impact on the world. But, one area we are starting to see AI have some mastery over is the world of advertising.\nWelcome to ‘Brand New World,’ a podcast about this nascent moment in marketing and advertising as it all begins to take shape. Join ‘Fast Company’ senior staff editor Jeff Beer who takes a look at how creatives see their work evolving, how ad agencies are embracing this technology, and how big companies such as Google and Coca-Cola are leading the way in deploying AI to grow their brands. Jeff has been covering marketing and brands for the past two decades—during which he’s seen Burger King’s Subservient Chicken, Mac versus PC, Red Bull jump into the stratosphere, and a ‘Barbie’ movie—but never anything quite like this.", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts211/v4/78/64/b7/7864b753-c1bf-7ebb-788f-5db5f9358ea8/mza_18342730045006249884.jpg/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/brand-new-world/id1794780886?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "The Canadian Real Estate Investor - Daniel Foch & Nick Hill", "description": "The Podcast For Canadian Real Estate Investors.\n\nThe podcast features in depth discussion around investing in real estate, ongoing news in the Canadian real estate market, how to structure deals and grow your portfolio.\nShow hosts Daniel Foch and Nick Hill bring experience, fresh takes, well-researched information and entertainment to a real estate investing podcast for Canadians.", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts122/v4/7c/d0/c0/7cd0c0b9-967c-e74d-d06f-08a6d814bebf/mza_6096039864394715861.jpg/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/the-canadian-real-estate-investor/id1634197127?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "BiggerPockets Real Estate Podcast - BiggerPockets", "description": "Want financial freedom through real estate investing? Then the BiggerPockets Real Estate Podcast is for you. Sit down every Monday, Wednesday, and Friday with Dave Meyer, the Head of Real Estate at BiggerPockets, as he uncovers tried and true tactics and shares candid conversations with real estate investors who are building wealth in today’s market. Join Dave to walk through deals that went right (and wrong) and learn the strategies you can deploy—start growing your side income today to take control of your financial future. ", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts211/v4/d7/76/39/d7763936-f77b-d766-e972-a6ec5a2fcc7b/mza_1198935309827756564.jpeg/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/biggerpockets-real-estate-podcast/id594419649?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "The Ronan Levy Podcast - Ronan Levy", "description": "My name is Ronan and I’ve got something to tell you. \n\nYou’re not going to like it. But I’m going to tell you anyway. And it’s this. \n\nContrary to what you may have been taught, money, success and fame don’t make you happy, won’t make you healthy and can’t give you peace inside. \n\nTrust me after years of chasing all 3 and multiple 7 figure exits, I learned that the hard way. \n\nAnd that’s why I started the Ronan Levy Podcast. To help people like you and me start to rewrite the rules of happiness, redefine success and rediscover what’s meaningful.", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts211/v4/c0/2f/81/c02f819e-bcb9-efe4-0fa6-4251364ee7ee/mza_1283749801352443144.jpeg/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/the-ronan-levy-podcast/id1518082693?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "Financial Feminist - Her First $100K | YAP Media", "description": "Fight the patriarchy. Get Rich.™ \nJoin money expert Tori Dunlap as she guides you on how to make more, spend less, and feel financially confident in a world run by rich white men. Through solo episodes and special guest interviews, you’ll walk away with resources to get, save, and grow money to gain financial freedom and kick some patriarchal ass at the same time. New episodes drop every Monday, and mini-episodes drop every other Thursday.", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts122/v4/33/4d/7e/334d7ebd-f878-6ecd-7c63-f7f9d139c126/mza_442253671904754747.jpeg/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/financial-feminist/id1566054936?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "James Reed: all about business - Reed Global", "description": "'James Reed: all about business' puts you at the heart of fun, dynamic, candid conversation with business leaders, philanthropists and charitable celebrities as they use their journeys to give clear, actionable advice.\n\nHosted by James Reed CBE, the Chairman and CEO of Reed Group, you’ll hear the highs and lows of what it means to be a true business leader to empower you to implement smarter, more meaningful strategy in your business or career.", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts221/v4/3c/e3/3b/3ce33b54-433d-aa33-4c6b-7ca528f61482/mza_6597508493664614695.png/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/james-reed-all-about-business/id1773330038?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "Second in Command: The Chief Behind the Chief - Second in Command: The Chief Behind the Chief", "description": "Welcome to the “Second in Command” Podcast hosted by Cameron Herold, brought to you by the COO Alliance, where top-level COOs share their insights, tactics, and strategies that made them the Chief Behind the Chief. \n\nCameron Herold founded the COO Alliance with one simple goal in mind: to provide COOs with the same professional development and growth opportunities CEOs have enjoyed for many years. COO Alliance is the world's leading network for the Second in Command.\n\nCameron Herold is a top business consultant, best-selling author, and speaker. He’s the mastermind behind hundreds of companies’ exponential growth and he’s touched thousands of businesses indirectly through his work.", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts126/v4/20/9c/12/209c1253-8f36-efac-2cd7-ae4ad61d98c5/mza_15022478233153651429.jpg/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/second-in-command-the-chief-behind-the-chief/id1368800817?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "Coffeez for Closers with Joe Shalaby - E Mortgage Capital", "description": "Welcome to \"Coffeez for Closers,\" a podcast that brings the heart and expertise of a family-owned business to the forefront of entrepreneurial and business discussions. Hosted by Joseph Shalaby, Broker and CEO of E Mortgage Capital Inc., this show delves into the world of business with the warmth and wisdom that only comes from a leader who has built a successful company from the ground up with close friends and colleagues.\n\nEach episode, Joseph Shalaby draws on his own experiences and those of his esteemed guests to explore topics ranging from effective leadership and teamwork to innovative business strategies and industry insights. Whether you're a professional in the mortgage industry, an aspiring entrepreneur, or simply interested in the intricacies of running a successful business, \"Coffeez for Closers\" promises enriching conversations and invaluable lessons.", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts221/v4/9d/7a/40/9d7a406c-2999-3d7d-eeed-ad811d636ba3/mza_2657850444806919460.png/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/coffeez-for-closers-with-joe-shalaby/id1726674707?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "Omni Talk Retail - Omni Talk Retail", "description": "Omni Talk Retail provides news, analysis, and commentary on the latest trends and issues in the retail industry. It covers a wide range of topics related to retail, including e-commerce, technology, marketing, and consumer behavior. The podcast regularly features industry experts, Chris Walton and Anne Mezzenga, as well as retail thought leaders who all share their insights and perspectives on the latest developments in retail.\n\nThis podcast uses the following third-party services for analysis: \n\nPodcorn - https://podcorn.com/privacy", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts221/v4/0b/7e/29/0b7e292b-ca07-eafd-4776-cca51db1839d/mza_518828566071530842.jpg/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/omni-talk-retail/id1354437454?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "Business Wars - Wondery", "description": "Netflix vs. HBO. Nike vs. Adidas. Business is war. Sometimes the prize is your wallet or your attention. Sometimes, it’s just the fun of beating the other guy. The outcome of these battles shapes what we buy and how we live. \nBusiness Wars gives you the unauthorized, real story of what drives these companies and their leaders, inventors, investors and executives to new heights -- or to ruin. Hosted by David Brown, former anchor of Marketplace. From Wondery, the network behind Dirty John and American History Tellers.\nListen to Business Wars on the Wondery App or wherever you get your podcasts. Experience all episodes ad-free and be the first to binge the newest season. Unlock exclusive early access by joining Wondery+ in the Wondery App or on Apple Podcasts. Start your free trial today by visiting wondery.com/links/business-wars/ now.", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts211/v4/9a/54/b1/9a54b13c-693a-19d0-2851-6d8ad3959b0f/mza_2081264450058823114.jpeg/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/business-wars/id1335814741?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "Do This, NOT That: Marketing Tips with Jay Schwedelson l Presented By Marigold - GURU Media Hub", "description": "Welcome to \"Do This, NOT That!\" - your ultimate destination for mastering marketing insights. Join us as we dive deep into the world of marketing, unlocking powerful strategies and game-changing tactics that will revolutionize your approach.Our podcast offers actionable takeaways and practical advice to supercharge your marketing game. Explore the power of decision-making, the art of nurturing contacts, and the influence of loss aversion in marketing. Discover how anchoring and positive psychology can elevate your campaigns to new heights.Unravel the secrets of understanding your audience's minds and tapping into behavioral science principles. We guide you on a journey to marketing mastery, empowering you to make the right decisions and drive remarkable results.Tune in to \"Do This, NOT That!\" to unlock your full marketing potential, stay ahead in the competitive landscape, and embark on this thrilling marketing adventure with us!MASSIVE thank you to our Sponsor, Marigold!!Marigold is a relationship marketing platform designed to help you acquire new customers and turn them into superfans with their best-in-class loyalty solutions. Don’t take my word for it though, American Airlines, Honeybaked Ham, Title Boxing, and Notre Dame University are also customers!Regardless of your size, check out Marigold today to get the solution you need to grow your business!", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts221/v4/7c/81/4c/7c814ca4-8478-7e8e-998d-2be85453561b/mza_15378459715720736143.jpg/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/do-this-not-that-marketing-tips-with-jay-schwedelson/id1701260891?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "Smart Money Happy Hour with Rachel Cruze and George Kamel - Ramsey Network", "description": "Pull up a chair to the happy hour you wish your friends were having. Mix two money experts with some hot takes and a splash of nostalgia, and you get Rachel Cruze and George Kamel talking unfiltered about what’s going on in the world, pop culture, and how to afford a life you love.", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts112/v4/56/5c/4c/565c4c4d-5fb5-f9f7-553e-165904508e6c/mza_442608739087407915.jpg/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/smart-money-happy-hour-with-rachel-cruze-and-george-kamel/id1645380849?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "The Clark Howard Podcast - Clark Howard", "description": "Save more and spend less is more than just a motto for money expert Clark Howard; it’s a way of life. Clark and his crew — Team Clark — are on a mission to empower people to take control of their personal finances by providing money-saving tips, consumer advice, hot deals and economic news to help everyone achieve financial freedom. Clark is a nationally syndicated radio talk show host and a consumer reporter for television stations around the country. His podcast, The Clark Howard Show, receives more than one million downloads each month and is a hub for listeners to get valuable advice on-demand any time. Clark answers questions on the most popular business and consumer topics including; how to buy a cars, financing a home, retirement planning, shopping for insurance and getting the most out of your savings. Join the conversation and submit your question to www.clark.com/askclark . Clark spearheads two free resources — Clark.com and ClarkDeals.com — to encourage consumers to save more, spend less and avoid ripoffs.", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts221/v4/36/da/0b/36da0b96-6ef5-3d8e-e828-814cebbc532c/mza_12744719361655317180.jpg/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/the-clark-howard-podcast/id207724573?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "Bubbles & Biz - Bubbles & Biz", "description": "Join me as I sit down with small business owners and entrepreneurs over champagne to discuss the ups, downs and hacks for running a business! 🥂", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts125/v4/52/98/7a/52987a35-4301-5bd4-5935-fab298c282a1/mza_17503450694344878786.jpg/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/bubbles-biz/id1448430655?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "The Money with Katie Show - Morning Brew", "description": "Finance bros are out, #RichGirls are in. Join Money with Katie and her guests for conversations about where the economic, cultural, and political meet the practical personal finance education that everyone needs. Listen weekly on Wednesdays.", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts221/v4/12/21/4a/12214ae3-b311-a887-8831-90583165e453/mza_8103635740711007356.jpeg/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/the-money-with-katie-show/id1589146097?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "Money Guy Show - Brian Preston and Bo Hanson", "description": "Bring confidence to your wealth building with simplified strategies from The Money Guy. Learn how to apply financial tactics that go beyond common sense and help you reach your money goals faster. Make your assets do the heavy lifting so you can quit worrying and start living a more fulfilled life.", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts211/v4/64/fc/be/64fcbe3a-21e9-5ea8-7f42-7b63da433cfb/mza_10029232866772087837.jpg/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/money-guy-show/id121362031?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "My First Million - Hubspot Media", "description": "Sam Parr and Shaan Puri brainstorm new business ideas based on trends & opportunities they see in the market. Sometimes they bring on famous guests to brainstorm with them.", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts126/v4/99/58/52/995852a1-a866-ecff-5636-81d8b7b7b55d/mza_17098628894380561971.jpeg/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/my-first-million/id1469759170?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "Mad Money w/ Jim Cramer - CNBC", "description": "“Mad Money” takes viewers inside the mind of one of Wall Street’s most respected and successful money managers for free. Cramer is listeners’ personal guide through the confusing jungle of Wall Street investing, navigating through opportunities and pitfalls with one goal in mind—to help you make money. “Mad Money” features the unmatched, fiery opinions of Jim Cramer and the popular Lightning Round, in which he gives his buy, sell and hold opinions on stocks to callers.", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts126/v4/a6/10/d9/a610d93b-1d46-a609-da24-ad923d1b53f0/mza_5451291074090332499.jpg/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/mad-money-w-jim-cramer/id147247199?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "Financial Audit - Caleb Hammer", "description": "Personal finance nerd at heart! Making content to entertain and educate. Want to be on the show? Email us at casting@calebhammer.com Sponsorship and business inquiries: business@calebhammer.com\n\nGet new episodes a week earlier on our YouTube channel!", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts221/v4/b9/e8/c1/b9e8c18d-6db9-e2db-5fbb-02c9b88bcfed/mza_11588913954898061535.jpg/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/financial-audit/id1691595080?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "HBR On Leadership - Harvard Business Review", "description": "Hand-curated insights and inspiration to unlock the best in those around you.", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts221/v4/10/a1/04/10a10495-b053-8dff-afbc-634b91573958/mza_8698160288726515302.png/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/hbr-on-leadership/id1683948659?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "Animal Spirits Podcast - The Compound", "description": "Animal Spirits is a show about markets, life, and investing. Join Michael Batnick and Ben Carlson as they talk about what they're reading, writing, listening to and watching. Look for new episodes every Wednesday morning. See our disclosures here - https://ritholtzwealth.com/podcast-youtube-disclosures/", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts122/v4/e9/28/32/e92832e6-b6a7-9ff5-07bd-76745ff715d9/mza_17095200695885559410.jpg/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/animal-spirits-podcast/id1310192007?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "Marketplace Morning Report - Marketplace", "description": "In less than 10 minutes, we’ll get you up to speed on all the news you missed overnight. Throughout the morning, Marketplace’s David Brancaccio will bring you the latest business and economic stories you need to know to start your day. And before U.S. markets open, you’ll get a global markets update from the BBC World Service in London. ", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts211/v4/ea/51/cc/ea51cc6a-8543-59e6-1c8f-9b95105c1124/mza_648694724814937557.png/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/marketplace-morning-report/id137329814?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "CNBC's \"Fast Money\" - CNBC", "description": "Hosted by Melissa Lee and a roundtable of top traders, “Fast Money” breaks through the noise of the day, to deliver the actionable news that matters most to investors. Fast Money airs weeknights at 5p ET on CNBC. Visit http://fastmoney.cnbc.com for additional information.", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts126/v4/a2/9c/7a/a29c7aaa-ff4b-c369-5a75-a370ac64f991/mza_6374213583347834097.jpg/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/cnbcs-fast-money/id215529509?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "Real Estate Rookie - BiggerPockets", "description": "Ready to build your real estate empire… but not sure where to begin?\nThink of us as your personal trainer.\nFrom detailed breakdowns of real-world deals… to one-on-one coaching sessions and a warm, welcoming community… hosts Ashley Kehr and Tony J Robinson bring on a wide range of guests to tackle the “newbie” questions you've wondered about but might be afraid to ask.\nLooking to 10X your real estate investing business this year? This show isn’t for you.\nLooking for your first, second, or third deal -- or envisioning a more modest portfolio? Step right up. \nEvery Monday, Wednesday and Friday, we’ll arm you with the tips, tools, and roadmaps you'll need as you embark on your journey toward financial freedom.", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts211/v4/05/6d/c1/056dc1cb-7a55-818d-e497-5e1f4ad5d6a8/mza_15968133740018437498.jpg/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/real-estate-rookie/id1499646507?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "Invest Like the Best with Patrick O'Shaughnessy - Colossus | Investing & Business Podcasts", "description": "Conversations with the best investors and business leaders in the world. We explore their ideas, methods, and stories to help you better invest your time and money. Hear stock market and boardroom insights you can't find anywhere else. If you're a professional investor, CEO, entrepreneur, or business strategist, this is for you. Explore all our episodes and learn more at https://www.joincolossus.com", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts211/v4/9c/72/e5/9c72e583-25bd-9ca3-79a0-51d91f8ab5d6/mza_7928045410094500375.jpg/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/invest-like-the-best-with-patrick-oshaughnessy/id1154105909?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "Craig Groeschel Leadership Podcast - Life.Church", "description": "The Craig Groeschel Leadership Podcast offers personal, practical coaching lessons that take the mystery out of leadership. In each episode of the Craig Groeschel Leadership Podcast, Craig brings you empowering insights and easy-to-understand takeaways you can use to lead yourself and lead your team. You’ll learn effective ways to grow as a leader, optimize your time, develop your team, and structure your organization.", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts125/v4/1c/fa/ae/1cfaaecd-5257-9a87-03a3-530bb3b528d5/mza_15517936354659282557.jpg/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/craig-groeschel-leadership-podcast/id1070649025?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "Worklife with Adam Grant - TED", "description": "You spend a quarter of your life at work. You should enjoy it! Organizational psychologist Adam Grant takes you inside the minds of some of the world’s most unusual professionals to discover the keys to a better work life. From learning how to love your rivals to harnessing the power of frustration, one thing’s for sure: You’ll never see your job the same way again. Produced in partnership with Transmitter Media.\n Hosted on Acast. See acast.com/privacy for more information.", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts125/v4/64/64/19/646419d8-0249-3aa6-22e1-cf481814a28d/mza_16901703840593164642.png/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/worklife-with-adam-grant/id1346314086?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "Suze Orman's Women & Money (And Everyone Smart Enough To Listen) - Suze Orman Media", "description": "Take a priceless journey into your life and the life of your money with the most recognized personal finance expert in the world today.  Acclaimed for her revolutionary approach to money, Suze Orman has garnered millions of fans whose lives have been transformed by following her unique advice.  In about 30 minutes, you’ll learn how to go within yourself to see why you are doing without and that you cannot fix a financial problem with money. \n\nSuze brings over 40 years of experience to help you be more and therefore have more.   If you don’t have the money you want in your life, subscribe now to one of the most popular podcasts in America and find out why. The choice is up to you.\n\nNew episodes drop Thursdays and Sundays.\n\nJoin Suze’s free podcast Community by downloading the Women & Money App on the Apple App Store or Google Play, where you can search past episodes, ask Suze questions (that if chosen will be answered on the podcast) take classes and communicate with each other and possibly Suze herself.", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts125/v4/a8/4e/7b/a84e7b5d-3ed6-16fc-16fd-d024da9496ca/mza_9816247044360165861.jpg/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/suze-ormans-women-money-and-everyone-smart-enough-to-listen/id1439621652?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "Make Me Smart - Marketplace", "description": "Each weekday, Marketplace’s Kai Ryssdal and Kimberly Adams make today make sense. Along with our supersmart listeners, we break down happenings in tech, the economy and culture. Every Tuesday we bring on a guest to dive deeper into one important topic. Because none of us is as smart as all of us.", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts221/v4/29/28/6c/29286cb5-856f-4bb1-a284-8e3cc8e68113/mza_13702311703195248505.jpg/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/make-me-smart/id1181589165?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "Money And Wealth With John Hope Bryant - The Black Effect and iHeartPodcasts", "description": "John Hope Bryant- successful entrepreneur, executive and philanthropist –will dispense his trademark ‘Straight Talk’ lessons on developing a wealth-building mindset, specifically how the Black community never got “the memo” on money – essentially how to survive and thrive in a free enterprise system.\n\n\n\nWhile often provocative, Bryant will unpack the issues of the day, along with practical advice on how listeners will not only improve their current financial position, but learn how to grow and create personal wealth for themselves and their families.\n\n\n\nEpisodes will mostly feature Bryant speaking directly to the audience, with occasional guests ranging from “person on the street” interviews with inspirational individuals Bryant encounters in his travels around the world, or from his network of some of world’s most extraordinary people.", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts126/v4/07/bc/81/07bc81ed-9542-9e12-2e12-830df95ef2eb/mza_4472252107795150149.jpg/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/money-and-wealth-with-john-hope-bryant/id1729790200?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "The EntreLeadership Podcast - Ramsey Network", "description": "Whatever you lead can only grow when you do. Experience real-life, real-time business and leadership coaching from Dave Ramsey, a successful CEO, popular radio personality, bestselling author, and now the host of The EntreLeadership Podcast. Dave takes your calls and draws on over 30 years of experience as the CEO of Ramsey Solutions to help you overcome the challenges you're facing. More at https://www.ramseysolutions.com/shows/the-entreleadership-podcast.", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts112/v4/83/b4/16/83b416c3-0335-0473-be30-e20f61652b78/mza_10040790650618432506.jpg/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/the-entreleadership-podcast/id435836905?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "We Study Billionaires - The Investor’s Podcast Network - The Investor's Podcast Network", "description": "We interview and study famous financial billionaires, including Warren Buffett, Ray Dalio, and Howard Marks, and teach you what we learn and how you can apply their investment strategies in the stock market.\nWe Study Billionaires is the largest stock investing podcast show in the world with 180,000,000+ downloads and is hosted by Stig Brodersen, Preston Pysh, William Green, Clay Finck, and Kyle Grieve.\nThis podcast also includes the Richer Wiser Happier series hosted by best-selling author William Green. William regularly interviews legendary investors such as Mohnish Pabrai and Guy Spier, exploring what they can teach us about how to succeed in markets and life.\nAnd finally, our Bitcoin Fundamentals series is hosted by Preston Pysh, where he interviews prominent figures in the Bitcoin and macroeconomic space. To learn more about TIP, you can visit theinvestorspodcast.com or subscribe to our free daily newsletter here.\nSupport our show by becoming a premium member! https://theinvestorspodcastnetwork.supportingcast.fm", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts211/v4/e5/1d/ec/e51decd3-c299-33d3-15dc-cbf732db40ba/mza_7000864012270734067.jpg/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/we-study-billionaires-the-investors-podcast-network/id928933489?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "The Personal Finance Podcast - Andrew Giancola", "description": "Andrew Giancola from Master Money reveals all of his personal finance, money, investing, business strategies, income sources, stock, and real estate investing tips so that you can build more wealth than you ever thought possible. Discover how to increase your income at your job and create multiple passive income streams that work for you, so you have the time and freedom to do what you love. Whether that’s travel, or having freedom from your day job. Since 2013, Andrew has been sharing the wins and losses of his personal finance journey. You will learn how to invest to create wealth in stocks, index funds, real estate, building businesses, and side-hustles. You will learn how to save more money, get a raise, set up simple budgets, build habits, personal growth, and money hacks that will take you to the next level with your finances. Take control of your money so you can live a stress-free, rich life. Anyone can be wealthy, Andrew will show you how. Hit subscribe and get ready to change your life.", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts112/v4/21/bd/03/21bd036a-3392-140c-a1ed-529bf08939be/mza_652415573522893490.jpeg/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/the-personal-finance-podcast/id1511786733?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "HBR IdeaCast - Harvard Business Review", "description": "A weekly podcast featuring the leading thinkers in business and management.", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts211/v4/28/4b/4e/284b4e44-9a28-dabf-e853-e60c43e380ad/mza_6581779795008535928.jpg/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/hbr-ideacast/id152022135?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "The Knowledge Project with Shane Parrish - Farnam Street", "description": "Master the best of what other people have already figured out. \n\nSkip decades of trial and error. Each episode reveals proven insights from world-class performers.\n\nNo fluff. No small talk. Just actionable wisdom for your business and life.\n\nInstagram: https://instagram.com/farnamstreet\nLinkedIn: https://www.linkedin.com/in/shane-parrish-050a2183/\nNewsletter: Join over 750,000 people and upgrade your thinking in 5 minutes a week. fs.blog/newsletter", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts211/v4/ff/c6/0a/ffc60a89-e0df-e9a9-ebc0-f7d90de78f3f/mza_4599874966018472515.png/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/the-knowledge-project-with-shane-parrish/id990149481?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "The Agile Brand with Greg Kihlström® - The Agile Brand", "description": "Stay curious. Stay agile. Marketing technology, AI, and CX insights from top brands and martech platforms fill every episode, focusing on what leaders need to know to build customer lifetime value and long-term business value. The Agile Brand with Greg Kihlström® features executives and thought leaders from top brands and platforms discussing the trends driving the industry forward, like first-party data strategies, artificial intelligence, consumer data privacy, omnichannel customer experience, and more. The Agile Brand is hosted by Greg Kihlström, advisor and consultant to leading brands, speaker, entrepreneur, and best-selling author. It provides a fresh perspective on the continually evolving dynamic between brands and the audiences they serve.", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts211/v4/46/83/8e/46838e60-8223-8f6f-2e1b-5e3e5dff13d6/mza_5708081482883481567.jpg/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/the-agile-brand-with-greg-kihlstr%C3%B6m/id1455031182?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "Full Disclosure with Roben Farzad - Roben Farzad", "description": "The business of culture. The culture of business. Policy; media & tech; entrepreneurs and more.", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts5/v4/81/e0/52/81e05259-3ce7-5218-007a-c27e94b73a86/mza_4584763007039740245.jpg/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/full-disclosure-with-roben-farzad/id903171979?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}, {"title": "Marketplace All-in-One - Marketplace", "description": "Marketplace® is the leading business news program in the nation. We bring you clear explorations of how economic news affects you, through stories, conversations, newsworthy numbers and more. The Marketplace All-in-One podcast provides each episode of the public radio broadcast programs Marketplace, Marketplace Morning Report®and Marketplace Tech® along with our podcasts Make Me Smart, Corner Office and The Uncertain Hour. Visit marketplace.org for more. From American Public Media. Twitter: @Marketplace", "image": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts123/v4/39/35/a6/3935a67f-1525-0cb3-39e4-4e3edeed512c/mza_2457639969504493133.png/55x55bb.png", "website": "https://podcasts.apple.com/us/podcast/marketplace-all-in-one/id294809296?uo=2", "categories": ["Business", "Top Rated"], "source": "iTunes"}]